In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('./CSVs/egypt_final.csv', skipinitialspace=True)

In [3]:
df['city'].value_counts()

Cairo          1486
Giza            238
Suez             36
North Coast      30
Red Sea          15
Alexandria        7
Sharqia           2
Al Daqahlya       1
Name: city, dtype: int64

In [4]:
df.drop(df.loc[df['city'] == "Suez"].index, inplace = True)
df.drop(df.loc[df['city'] == "Giza"].index, inplace = True)
df.drop(df.loc[df['city'] == "North Coast"].index, inplace = True)
df.drop(df.loc[df['city'] == "Red Sea"].index, inplace = True)
df.drop(df.loc[df['city'] == "Alexandria"].index, inplace = True)
df.drop(df.loc[df['city'] == "Sharqia"].index, inplace = True)
df.drop(df.loc[df['city'] == "Al Daqahlya"].index, inplace = True)

In [5]:
df.reset_index(drop = True, inplace = True)

In [6]:
df.tail()

,Baths,Beds,Location,Square Meter,base_price,city,country,page,property_type,sub_div
1481,NaN,NaN,"Sherket Al Maady St., New Maadi, Hay El Maadi,...",600,150000,Cairo,Egypt,comm,Office Space,Hay El Maadi
1482,NaN,NaN,"Al Nasr Road, 6th Zone, Nasr City, Cairo",72,15000,Cairo,Egypt,comm,Office Space,Nasr City
1483,NaN,NaN,"Street2, District 2, The 5th Settlement, New C...",200,90000,Cairo,Egypt,comm,Office Space,New Cairo City
1484,NaN,NaN,"Bank Center Street, South Teseen St., The 5th ...",519,488000,Cairo,Egypt,comm,Office Space,New Cairo City
1485,NaN,NaN,"Business Plus, North Teseen St., The 5th Settl...",74,15000,Cairo,Egypt,comm,Office Space,New Cairo City

In [7]:
df.to_csv('./CSVs/cairo_only.csv', index = False)

In [8]:
df['page'].value_counts()

rent    549
buy     473
comm    464
Name: page, dtype: int64

In [9]:
df_buy = df.drop(df.loc[(df['page'] == 'comm') | (df['page'] == 'rent')].index)

In [10]:
df_buy.to_csv('./CSVs/cairo_only_buy.csv', index = False)

In [11]:
df_buy = df_buy.append({'Location': 'Mansheya Nasir, Governorate Egypt, Cairo', 
           'base_price': 1, 'property_type': 'Informal Settlements', 
           'city': 'Cairo', "sub_div": 'Governorate Egypt'}, ignore_index = True)

In [12]:
df_buy = df_buy.append({'Location': 'Ezbet el-Haggana, Nasr City, Egypt', 
           'base_price': 1, 'property_type': 'Informal Settlements', 
           'city': 'Cairo', "sub_div": 'Nasr City'}, ignore_index = True)

In [13]:
df_buy = df_buy.append({'Location': "7 Branshed from Al Soultan Ahmed, El-Darb El-Ahmar, Monsha'et Nasser, Cairo Governorate, Egypt", 
           'base_price': 1, 'property_type': 'Informal Settlements', 
           'city': 'Cairo', "sub_div": 'Governorate Egypt'}, ignore_index = True)

In [14]:
df_buy.tail()

,Baths,Beds,Location,Square Meter,base_price,city,country,page,property_type,sub_div
471,3,4,"Bait Alwatan, The 5th Settlement, New Cairo Ci...",225,1530000,Cairo,Egypt,buy,Apartment,New Cairo City
472,3,3,"Bait Alwatan, The 5th Settlement, New Cairo Ci...",192,1305600,Cairo,Egypt,buy,Apartment,New Cairo City
473,NaN,NaN,"Mansheya Nasir, Governorate Egypt, Cairo",NaN,1,Cairo,NaN,NaN,Informal Settlements,Governorate Egypt
474,NaN,NaN,"Ezbet el-Haggana, Nasr City, Egypt",NaN,1,Cairo,NaN,NaN,Informal Settlements,Nasr City
475,NaN,NaN,"7 Branshed from Al Soultan Ahmed, El-Darb El-A...",NaN,1,Cairo,NaN,NaN,Informal Settlements,Governorate Egypt

In [15]:
df_buy.to_csv('./CSVs/cairo_only_buy_3slums.csv', index = False)

# Latitude and Longitude CSV

In [16]:
df = pd.read_csv('./CSVs/with_coords.csv')

In [17]:
df.head()

,Baths,Beds,Location,Square Meter,base_price,city,country,page,price_usd,property_type,sub_div,lat,lon
0,2,2,"Baymount, Al Ain Al Sokhna, Suez",105,1200000,Suez,Egypt,buy,18876000.0,Chalet,Al Ain Al Sokhna,30.074282,31.544374
1,2,2,"Aroma Residence, Al Ain Al Sokhna, Suez",95,1550000,Suez,Egypt,buy,24381500.0,Chalet,Al Ain Al Sokhna,30.074282,31.544374
2,4,4,"The Courtyards, Sheikh Zayed Compounds, Sheikh...",286,4750000,Giza,Egypt,buy,74717500.0,Townhouse,Sheikh Zayed City,30.048347,30.983223
3,4,5,"Mivida, 5th Settlement Compounds, The 5th Sett...",391,8400000,Cairo,Egypt,buy,132132000.0,Villa,New Cairo City,30.063103,31.455447
4,2,3,"IL Monte Galala, Al Ain Al Sokhna, Suez",119,2900000,Suez,Egypt,buy,45617000.0,Chalet,Al Ain Al Sokhna,30.074282,31.544374

In [18]:
df.drop_duplicates(inplace = True)

In [19]:
df.isnull().sum()

Baths             460
Beds             1588
Location            0
Square Meter       27
base_price          0
city                0
country             0
page                0
price_usd           0
property_type       0
sub_div             0
lat                 0
lon                 0
dtype: int64

In [20]:
df[['lat', 'lon']].describe()

               lat          lon
count  6216.000000  6216.000000
mean     26.636846    27.795596
std       9.535674     9.952087
min       0.000000     0.000000
25%      30.020128    31.243666
50%      30.048819    31.404629
75%      30.063103    31.455447
max      30.969322    31.760475

In [21]:
df.loc[df['lat'] == 0]

,Baths,Beds,Location,Square Meter,base_price,city,country,page,price_usd,property_type,sub_div,lat,lon
32,3,4,"Al Patio 5, El Patio, El Shorouk Compounds, Sh...",365,5200000,Cairo,Egypt,buy,81796000.00,Townhouse,Shorouk City,0.0,0.0
71,4,4,"Hacienda Bay, Sidi Abdel Rahman, North Coast",360,5300000,North Coast,Egypt,buy,83369000.00,Villa,Sidi Abdel Rahman,0.0,0.0
72,2,3,"La Vista Gardens, La Vista, Al Ain Al Sokhna, ...",150,2500000,Suez,Egypt,buy,39325000.00,Chalet,Al Ain Al Sokhna,0.0,0.0
76,2,3,"Green Avenue, New Capital Compounds, New Capit...",158,1580000,Cairo,Egypt,buy,24853400.00,Apartment,New Capital City,0.0,0.0
96,2,2,"Marassi, Sidi Abdel Rahman, North Coast",124,3912388,North Coast,Egypt,buy,61541863.24,Apartment,Sidi Abdel Rahman,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
6192,1,NaN,"Toreel Area, Al Mansoura, Al Daqahlya",16,3500,Al Daqahlya,Egypt,commercial,55055.00,Office Space,Al Mansoura,0.0,0.0
6195,1,NaN,"Abdel Salam Aref Street, Al Mansoura, Al Daqahlya",65,20000,Al Daqahlya,Egypt,commercial,314600.00,Retail,Al Mansoura,0.0,0.0
6198,2,NaN,"Toreel Area, Al Mansoura, Al Daqahlya",25,3500,Al Daqahlya,Egypt,commercial,55055.00,Retail,Al Mansoura,0.0,0.0
6202,1,NaN,"Ibn Battuta St., El Korba, Heliopolis - Masr E...",40,50000,Cairo,Egypt,commercial,786500.00,Office Space,Heliopolis - Masr El Gedida,0.0,0.0
6203,3,NaN,"Abd Al Moneim Hafez St., Almazah, Heliopolis -...",160,30000,Cairo,Egypt,commercial,471900.00,Retail,Heliopolis - Masr El Gedida,0.0,0.0

In [22]:
df.drop(df.loc[df['lat'] == 0].index, inplace = True)

In [23]:
df[['lat', 'lon']].describe()

               lat          lon
count  5510.000000  5510.000000
mean     30.049843    31.357065
std       0.058006     0.198623
min      29.550000    28.747900
25%      30.020128    31.263055
50%      30.048819    31.455447
75%      30.063103    31.455447
max      30.969322    31.760475

In [24]:
df.shape

(5510, 13)

In [25]:
df.drop(df.loc[df['lat'] > 30.3].index, inplace = True)

df.drop(df.loc[df['lon'] > 32].index, inplace = True)

df.drop(df.loc[df['lat'] < 30].index, inplace = True)

df.drop(df.loc[df['lon'] < 31].index, inplace = True)

In [26]:
df = df.append({'Location': 'Manshiyet Nasr', 
           'base_price' : 1, 'lat': 30.0362, 'lon': 31.2783}, 
           ignore_index = True)

In [27]:
df = df.append({'Location': 'Madinat an Nasr, Nasr City',
           'base_price' : 1, 'lat': 30.0666667, 'lon': 31.3}, 
          ignore_index = True)

In [28]:
df = df.append({'Location': 'Imbaba', 
           'base_price' : 1, 'lat': 30.0833333, 'lon': 31.2166667}, 
          ignore_index = True)

In [29]:
#df = df.append({'Location': 'Ezbet Khayrallah', 
#           'base_price' : 1, 'lat': 31.3, 'lon': 30.93}, 
#          ignore_index = True)

In [30]:
df = df.append({'Location': 'Ramlet Boulak', 
           'base_price' : 1, 'lat': 30.0711, 'lon': 31.2300}, 
          ignore_index = True)

In [31]:
df = df.append({'Location': 'Ezbet Abu Qarn', 
           'base_price' : 1, 'lat': 30.0011, 'lon': 31.2316}, 
          ignore_index = True)

In [32]:
df = df.append({'Location': 'Ezbet El Haggana', 
           'base_price' : 1, 'lat': 30.0645, 'lon': 31.3816}, 
          ignore_index = True)

In [33]:
df = df.append({'Location': 'Shubra Al Kheima', 
           'base_price' : 1, 'lat': 30.1286111, 'lon': 31.2422222}, 
          ignore_index = True)

In [34]:
df.to_csv('./CSVs/coord_no_zeros.csv', index = False)

# Shapefile Manipulation